src/test/resources/mst_a20_test.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP:Body>
		<d2LogicalModel xmlns="http://datex2.eu/schema/2/2_0"
			xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
			modelBaseVersion="2">
			<exchange>
				<supplierIdentification>
					<country>nl</country>
					<nationalIdentifier>NLNDW</nationalIdentifier>
				</supplierIdentification>
			</exchange>
			<payloadPublication xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
				xsi:type="MeasurementSiteTablePublication" lang="nl">
				<publicationTime>2016-09-07T11:00:00.000Z</publicationTime>
				<publicationCreator>
					<country>nl</country>
					<nationalIdentifier>NLNDW</nationalIdentifier>
				</publicationCreator>
				<headerInformation>
					<confidentiality>noRestriction</confidentiality>
					<informationStatus>real</informationStatus>
				</headerInformation>
				<measurementSiteTable id="NDW01_MT" version="868">
					<measurementSiteRecord id="RWS01_MONIBAS_0201hrr0197ra"
						version="1">
						<measurementSiteRecordVersionTime>2005-05-30T22:00:00Z</measurementSiteRecordVersionTime>
						<computationMethod>arithmeticAverageOfSamplesInATimePeriod</computationMethod>
						<measurementEquipmentTypeUsed>
							<values>
								<value lang="nl">lus</value>
							</values>
						</measurementEquipmentTypeUsed>
						<measurementSiteName>
							<values>
								<value lang="nl">0201hrr0197ra</value>
							</values>
						</measurementSiteName>
						<measurementSiteNumberOfLanes>2</measurementSiteNumberOfLanes>
						<measurementSide>eastBound</measurementSide>
						<measurementSpecificCharacteristics
							index="1">
							<measurementSpecificCharacteristics>
								<accuracy>100</accuracy>
								<period>60</period>
								<specificLane>lane1</specificLane>
								<specificMeasurementValueType>trafficFlow</specificMeasurementValueType>
								<specificVehicleCharacteristics>
									<vehicleType>anyVehicle</vehicleType>
								</specificVehicleCharacteristics>
							</measurementSpecificCharacteristics>
						</measurementSpecificCharacteristics>
						<measurementSpecificCharacteristics
							index="2">
							<measurementSpecificCharacteristics>
								<accuracy>100</accuracy>
								<period>60</period>
								<specificLane>lane1</specificLane>
								<specificMeasurementValueType>trafficSpeed</specificMeasurementValueType>
								<specificVehicleCharacteristics>
									<vehicleType>anyVehicle</vehicleType>
								</specificVehicleCharacteristics>
							</measurementSpecificCharacteristics>
						</measurementSpecificCharacteristics>
						<measurementSpecificCharacteristics
							index="3">
							<measurementSpecificCharacteristics>
								<accuracy>100</accuracy>
								<period>60</period>
								<specificLane>lane2</specificLane>
								<specificMeasurementValueType>trafficFlow</specificMeasurementValueType>
								<specificVehicleCharacteristics>
									<vehicleType>anyVehicle</vehicleType>
								</specificVehicleCharacteristics>
							</measurementSpecificCharacteristics>
						</measurementSpecificCharacteristics>
						<measurementSpecificCharacteristics
							index="4">
							<measurementSpecificCharacteristics>
								<accuracy>100</accuracy>
								<period>60</period>
								<specificLane>lane2</specificLane>
								<specificMeasurementValueType>trafficSpeed</specificMeasurementValueType>
								<specificVehicleCharacteristics>
									<vehicleType>anyVehicle</vehicleType>
								</specificVehicleCharacteristics>
							</measurementSpecificCharacteristics>
						</measurementSpecificCharacteristics>
						<measurementSiteLocation xsi:type="Point">
							<locationForDisplay>
								<latitude>51.91892</latitude>
								<longitude>4.31225</longitude>
							</locationForDisplay>
							<supplementaryPositionalDescription>
								<affectedCarriagewayAndLanes>
									<carriageway>mainCarriageway</carriageway>
								</affectedCarriagewayAndLanes>
							</supplementaryPositionalDescription>
							<alertCPoint xsi:type="AlertCMethod4Point">
								<alertCLocationCountryCode>8</alertCLocationCountryCode>
								<alertCLocationTableNumber>5.11</alertCLocationTableNumber>
								<alertCLocationTableVersion>A</alertCLocationTableVersion>
								<alertCDirection>
									<alertCDirectionCoded>positive</alertCDirectionCoded>
								</alertCDirection>
								<alertCMethod4PrimaryPointLocation>
									<alertCLocation>
										<specificLocation>8082</specificLocation>
									</alertCLocation>
									<offsetDistance>
										<offsetDistance>2300</offsetDistance>
									</offsetDistance>
								</alertCMethod4PrimaryPointLocation>
							</alertCPoint>
						</measurementSiteLocation>
					</measurementSiteRecord>

					<measurementSiteRecord id="RWS01_MONIBAS_0201hrr0200ra"
						version="1">
						<measurementSiteRecordVersionTime>2005-05-30T22:00:00Z</measurementSiteRecordVersionTime>
						<computationMethod>arithmeticAverageOfSamplesInATimePeriod</computationMethod>
						<measurementEquipmentTypeUsed>
							<values>
								<value lang="nl">lus</value>
							</values>
						</measurementEquipmentTypeUsed>
						<measurementSiteName>
							<values>
								<value lang="nl">0201hrr0200ra</value>
							</values>
						</measurementSiteName>
						<measurementSiteNumberOfLanes>2</measurementSiteNumberOfLanes>
						<measurementSide>eastBound</measurementSide>
						<measurementSpecificCharacteristics
							index="1">
							<measurementSpecificCharacteristics>
								<accuracy>100</accuracy>
								<period>60</period>
								<specificLane>lane1</specificLane>
								<specificMeasurementValueType>trafficFlow</specificMeasurementValueType>
								<specificVehicleCharacteristics>
									<vehicleType>anyVehicle</vehicleType>
								</specificVehicleCharacteristics>
							</measurementSpecificCharacteristics>
						</measurementSpecificCharacteristics>
						<measurementSpecificCharacteristics
							index="2">
							<measurementSpecificCharacteristics>
								<accuracy>100</accuracy>
								<period>60</period>
								<specificLane>lane1</specificLane>
								<specificMeasurementValueType>trafficSpeed</specificMeasurementValueType>
								<specificVehicleCharacteristics>
									<vehicleType>anyVehicle</vehicleType>
								</specificVehicleCharacteristics>
							</measurementSpecificCharacteristics>
						</measurementSpecificCharacteristics>
						<measurementSpecificCharacteristics
							index="3">
							<measurementSpecificCharacteristics>
								<accuracy>100</accuracy>
								<period>60</period>
								<specificLane>lane2</specificLane>
								<specificMeasurementValueType>trafficFlow</specificMeasurementValueType>
								<specificVehicleCharacteristics>
									<vehicleType>anyVehicle</vehicleType>
								</specificVehicleCharacteristics>
							</measurementSpecificCharacteristics>
						</measurementSpecificCharacteristics>
						<measurementSpecificCharacteristics
							index="4">
							<measurementSpecificCharacteristics>
								<accuracy>100</accuracy>
								<period>60</period>
								<specificLane>lane2</specificLane>
								<specificMeasurementValueType>trafficSpeed</specificMeasurementValueType>
								<specificVehicleCharacteristics>
									<vehicleType>anyVehicle</vehicleType>
								</specificVehicleCharacteristics>
							</measurementSpecificCharacteristics>
						</measurementSpecificCharacteristics>
						<measurementSiteLocation xsi:type="Point">
							<locationForDisplay>
								<latitude>51.91838</latitude>
								<longitude>4.31649</longitude>
							</locationForDisplay>
							<supplementaryPositionalDescription>
								<affectedCarriagewayAndLanes>
									<carriageway>mainCarriageway</carriageway>
								</affectedCarriagewayAndLanes>
							</supplementaryPositionalDescription>
							<alertCPoint xsi:type="AlertCMethod4Point">
								<alertCLocationCountryCode>8</alertCLocationCountryCode>
								<alertCLocationTableNumber>5.11</alertCLocationTableNumber>
								<alertCLocationTableVersion>A</alertCLocationTableVersion>
								<alertCDirection>
									<alertCDirectionCoded>positive</alertCDirectionCoded>
								</alertCDirection>
								<alertCMethod4PrimaryPointLocation>
									<alertCLocation>
										<specificLocation>8082</specificLocation>
									</alertCLocation>
									<offsetDistance>
										<offsetDistance>2600</offsetDistance>
									</offsetDistance>
								</alertCMethod4PrimaryPointLocation>
							</alertCPoint>
						</measurementSiteLocation>
					</measurementSiteRecord>
				</measurementSiteTable>
			</payloadPublication>
		</d2LogicalModel>
	</SOAP:Body>
</SOAP:Envelope>